micropython/micropython/ports/esp32/network_wlan.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * Development of the code in this file was sponsored by Microbric Pty Ltd
 * and Mnemote Pty Ltd
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016, 2017 Nick Moore @mnemote
 * Copyright (c) 2017 "Eric Poulsen" <eric@zyxod.com>
 *
 * Based on esp8266/modnetwork.c which is Copyright (c) 2015 Paul Sokolovsky
 * And the ESP IDF example code which is Public Domain / CC0
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <string.h>

#include "py/objlist.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "extmod/modnetwork.h"
#include "shared/netutils/netutils.h"
#include "modnetwork.h"

#include "esp_wifi.h"
#include "esp_idf_version.h"

#if MICROPY_PY_NETWORK_WLAN_CSI
#include "modwifi_csi.h"
#endif
#include "esp_log.h"
#include "esp_psram.h"
#if !CONFIG_ESP_HOSTED_ENABLED
#include "esp_wifi_ap_get_sta_list.h"
#endif

#ifndef NO_QSTR
#include "mdns.h"
#endif

#if MICROPY_PY_NETWORK_WLAN

#if (WIFI_MODE_STA & WIFI_MODE_AP != WIFI_MODE_NULL || WIFI_MODE_STA | WIFI_MODE_AP != WIFI_MODE_APSTA)
#error WIFI_MODE_STA and WIFI_MODE_AP are supposed to be bitfields!
#endif

typedef base_if_obj_t wlan_if_obj_t;

static wlan_if_obj_t wlan_sta_obj;
static wlan_if_obj_t wlan_ap_obj;

// Set to "true" if esp_wifi_start() was called
static bool wifi_started = false;

// Set to "true" if the STA interface is requested to be connected by the
// user, used for automatic reassociation.
static bool wifi_sta_connect_requested = false;

// Set to "true" if the STA interface is connected to wifi and has IP address.
static bool wifi_sta_connected = false;

// Store the current status. 0 means None here, safe to do so as first enum value is WIFI_REASON_UNSPECIFIED=1.
static uint8_t wifi_sta_disconn_reason = 0;

#if MICROPY_HW_ENABLE_MDNS_QUERIES || MICROPY_HW_ENABLE_MDNS_RESPONDER
// Whether mDNS has been initialised or not
static bool mdns_initialised = false;
#endif

static uint8_t conf_wifi_sta_reconnects = 0;
static uint8_t wifi_sta_reconnects;

// The rules for this default are defined in the documentation of esp_wifi_set_protocol()
// rather than in code, so we have to recreate them here.
#if CONFIG_SOC_WIFI_HE_SUPPORT
// Note: No Explicit support for 5GHz here, yet
#define WIFI_PROTOCOL_DEFAULT (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AX)
#else
#define WIFI_PROTOCOL_DEFAULT (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
#define MICROPY_ESP_WIFI_HAS_DUAL_BAND_API (1)
#else
#define MICROPY_ESP_WIFI_HAS_DUAL_BAND_API (0)
#endif

// Keep Python-level constants stable across targets/IDF versions.
#define MICROPY_WIFI_BAND_MODE_2G_ONLY (1)
#define MICROPY_WIFI_BAND_MODE_5G_ONLY (2)
#define MICROPY_WIFI_BAND_MODE_AUTO (3)

static bool network_wlan_band_mode_is_auto(void) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    wifi_band_mode_t band_mode;
    if (esp_wifi_get_band_mode(&band_mode) == ESP_OK) {
        return band_mode == WIFI_BAND_MODE_AUTO;
    }
    #endif
    return false;
}

static esp_err_t network_wlan_set_protocol(wifi_interface_t ifx, uint16_t protocol_bitmap) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    if (network_wlan_band_mode_is_auto()) {
        wifi_protocols_t protocols;
        esp_err_t err = esp_wifi_get_protocols(ifx, &protocols);
        if (err != ESP_OK) {
            return err;
        }
        protocols.ghz_2g = protocol_bitmap;
        return esp_wifi_set_protocols(ifx, &protocols);
    }
    #endif
    return esp_wifi_set_protocol(ifx, (uint8_t)protocol_bitmap);
}

static esp_err_t network_wlan_get_protocol(wifi_interface_t ifx, uint16_t *protocol_bitmap) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    if (network_wlan_band_mode_is_auto()) {
        wifi_protocols_t protocols;
        esp_err_t err = esp_wifi_get_protocols(ifx, &protocols);
        if (err != ESP_OK) {
            return err;
        }
        // Preserve legacy semantics: protocol is reported as the 2.4 GHz view.
        *protocol_bitmap = protocols.ghz_2g;
        return ESP_OK;
    }
    #endif
    uint8_t protocol_bitmap_legacy;
    esp_err_t err = esp_wifi_get_protocol(ifx, &protocol_bitmap_legacy);
    if (err == ESP_OK) {
        *protocol_bitmap = protocol_bitmap_legacy;
    }
    return err;
}

static esp_err_t network_wlan_set_bandwidth(wifi_interface_t ifx, wifi_bandwidth_t bandwidth) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    if (network_wlan_band_mode_is_auto()) {
        wifi_bandwidths_t bandwidths;
        esp_err_t err = esp_wifi_get_bandwidths(ifx, &bandwidths);
        if (err != ESP_OK) {
            return err;
        }
        bandwidths.ghz_2g = bandwidth;
        return esp_wifi_set_bandwidths(ifx, &bandwidths);
    }
    #endif
    return esp_wifi_set_bandwidth(ifx, bandwidth);
}

static esp_err_t network_wlan_get_bandwidth(wifi_interface_t ifx, wifi_bandwidth_t *bandwidth) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    if (network_wlan_band_mode_is_auto()) {
        wifi_bandwidths_t bandwidths;
        esp_err_t err = esp_wifi_get_bandwidths(ifx, &bandwidths);
        if (err != ESP_OK) {
            return err;
        }
        // Preserve legacy semantics: bandwidth is reported as the 2.4 GHz view.
        *bandwidth = bandwidths.ghz_2g;
        return ESP_OK;
    }
    #endif
    return esp_wifi_get_bandwidth(ifx, bandwidth);
}

static esp_err_t network_wlan_set_band_mode(uint8_t band_mode) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    switch (band_mode) {
        case MICROPY_WIFI_BAND_MODE_2G_ONLY:
        case MICROPY_WIFI_BAND_MODE_5G_ONLY:
        case MICROPY_WIFI_BAND_MODE_AUTO:
            return esp_wifi_set_band_mode((wifi_band_mode_t)band_mode);
        default:
            return ESP_ERR_INVALID_ARG;
    }
    #else
    return band_mode == MICROPY_WIFI_BAND_MODE_2G_ONLY ? ESP_OK : ESP_ERR_NOT_SUPPORTED;
    #endif
}

static esp_err_t network_wlan_get_band_mode(uint8_t *band_mode) {
    #if MICROPY_ESP_WIFI_HAS_DUAL_BAND_API
    wifi_band_mode_t band_mode_raw;
    esp_err_t err = esp_wifi_get_band_mode(&band_mode_raw);
    if (err == ESP_OK) {
        *band_mode = (uint8_t)band_mode_raw;
        return ESP_OK;
    }
    #endif
    *band_mode = MICROPY_WIFI_BAND_MODE_2G_ONLY;
    return ESP_OK;
}

